DELETE FROM user_roles;
DELETE FROM users;
DELETE FROM meals;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password)
VALUES ('User', 'user@yandex.ru', 'password'),
       ('Admin', 'admin@gmail.com', 'admin');

INSERT INTO user_roles (role, user_id)
VALUES ('USER', 100000),
       ('ADMIN', 100001);

INSERT INTO meals (datetime, description, calories, user_id )
VALUES ('2021-02-10 10:00', 'Завтрак', 500, 100000),
       ('2021-02-10 13:00', 'Обед', 1000, 100000),
       ('2021-02-10 20:00', 'Ужин', 500, 100000),
       ('2021-02-11 00:00', 'Граница', 100, 100000),
       ('2021-02-11 10:00', 'Завтрак', 500, 100000),
       ('2021-02-11 13:00', 'Обед', 1000, 100000),
       ('2021-02-11 20:00', 'Ужин', 410, 100000),
       ('2021-02-10 10:00', 'Завтрак', 500, 100001),
       ('2021-02-10 13:00', 'Обед', 1000, 100001),
       ('2021-02-10 20:00', 'Ужин', 500, 100001),
       ('2021-02-11 00:00', 'Граница', 100, 100001),
       ('2021-02-11 10:00', 'Завтрак', 500, 100001),
       ('2021-02-11 13:00', 'Обед', 1000, 100001),
       ('2021-02-11 20:00', 'Ужин', 410, 100001);